Tekla Open API Reference for Tekla Structures 2025
PolygonNode Class
 The PolygonNode class represents flat geometry tree node.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.PolygonNode
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PolygonNode : IGeometryNode
<SerializableAttribute>
Public NotInheritable Class PolygonNode
	Implements IGeometryNode
The PolygonNode type exposes the following members.
Constructors
Name | Description
PolygonNode
 Initializes a new instance of the PolygonNode class.
Top
Properties
Name | Description
Contour
 Gets or sets the contour points of flat geometry.
IsAutomatic
 Gets a value indicating whether this geometry node was automatically generated (returns false if it was originally a user-defined part)
Top
Methods
Name | Description
AcceptVisitor
 Entry method for the visitor pattern
Clone
 Creates a new object that is a copy of the current instance.
Top
See Also
Reference
Tekla.Structures.Model Namespace